{"Opp_g": 
    {"open door": "open door involves opening a door", 
    "close door": "close door involves closing a door", 
    "open fridge": "open fridge involves opening a fridge", 
    "close fridge": "close fridge involves closing a fridge", 
    "open dishwasher": "open dishwasher involves opening a dishwasher", 
    "close dishwasher": "close dishwasher involves closing a dishwasher", 
    "open drawer": "open drawer involves opening a drawer", 
    "close drawer": "close drawer involves closing a drawer", 
    "clean table": "clean table involves cleaning a table", 
    "drink from cup": "drink from cup involves drinking from a cup", 
    "toggle switch": "toggle switch involves toggling a switch"}, 
            
"PAMAP2": 
    {"lying": "lying is static, with the body in place and in a horizontal position. The arms may be in motion or static and may be bent, straight, or bent-straight transform. The legs may be in motion or static and may be bent, straight or bent-straight transform.", 
    "sitting": "sitting is static, with the body in place and in a vertical position. The arms may be in motion or static and may be bent, straight, or bent-straight transform. The legs are static and bent.", 
    "standing": "standing is static, with the body in place and in a vertical position. The arms may be in motion or static and may be bent, straight, or bent-straight transform. The legs are static and straight.",
    "walking": "walking involves cyclic and translation motion, with the body in a vertical postion and moving forward. The arms are in motion and bent-straight transform. The legs are in motion, bent-straight transform and alternately move forward.",
    "running": "running involves intense cyclic and translation motion, with the body in a vertical position and moving forward. The arms are in motion and bent. The legs are in motion, bent-straight transform and alternately move forward.",
    "cycling": "cycling involves cyclic and translation motion, with the body in an inclined position and moving forward. The arms are static and may be bent or straight. The hands hold something. The legs are in motion and bent-straight transform. It involves a seat and bike.",
    "nordic walking": "nordic walking involves cyclic and translation motion, with the body in a vertical position and moving forward. The arms are in motion and bent-straight transform. The hands hold something. The legs are in motion, bent-straight transform and alternately move forward. It involves poles.",
    "ascending stairs": "ascending stairs involves cyclic motion, with the body in a vertical, inclined position and moving forward and up. The arms are in motion and may be bent, straight or bent-straight transform. The hands hold something. The legs are in motion, bent-straight transform, alternately move forward and up. It involves stairs.",
    "descending stairs": "descending stairs involves cyclic motion, with the body in a vertical, inclined position and moving forward and down. The arms are in motion and may be bent, straight or bent-straight transform. The hands hold something. The legs are in motion, bent-straight transform, alternately move forward and down. It involves stairs.",
    "vacuum cleaning": "vacuum cleaning involves free motion, with the body in a vertical, inclined postion and moving forward and backward. There is torso transform. The arms are in motion and may be bent, straight, or bent-straight transform. The hands hold something. The legs are in motion and may be bent, straight, or bent-straight transform. It involes a vacuum cleaner.",
    "ironing": "ironing involves free motion, with the body in a vertical, inclined postio. The body is in place and there is torso transform. The arms are in motion and may be bent, straight, or bent-straight transform. The hands hold something. The legs are in motion and may be bent or straight. It involves a set, iron and clothes.",
    "rope jumping": "rope jumping involves intense cyclic motion, with the body in place and in a vertical position, moving up and down. The arms are in motion and may be bent, straight, or bent-straight transform. The hands hold something. The legs are in motion, and may be bent, straight, or bent-straight transform and moving up and down. It involves rope."},

"harth":
    {"walking": "walking involves cyclic and translation motion, with the body in a vertical postion and moving forward. The arms are in motion and bent-straight transform. The legs are in motion, bent-straight transform and alternately move forward.",
    "running": "running involves intense cyclic and translation motion, with the body in a vertical position and moving forward. The arms are in motion and bent. The legs are in motion, bent-straight transform and alternately move forward.",
    "shuffling": "Stepping in place by non-cyclical and non-directional movement of the feet. Includes turning on the spot with feet movement not as part of walking bout. Without being able to see the feet, if movement of the upper body and surroundings indicate non-directional feet movement, shuffling can be inferred",
    "ascending stairs": "ascending stairs involves cyclic motion, with the body in a vertical, inclined position and moving forward and up. The arms are in motion and may be bent, straight or bent-straight transform. The hands hold something. The legs are in motion, bent-straight transform, alternately move forward and up. It involves stairs.",
    "descending stairs": "descending stairs involves cyclic motion, with the body in a vertical, inclined position and moving forward and down. The arms are in motion and may be bent, straight or bent-straight transform. The hands hold something. The legs are in motion, bent-straight transform, alternately move forward and down. It involves stairs.",
    "standing": "standing is static, with the body in place and in a vertical position. The arms may be in motion or static and may be bent, straight, or bent-straight transform. The legs are static and straight.",
    "sitting": "sitting is static, with the body in place and in a vertical position. The arms may be in motion or static and may be bent, straight, or bent-straight transform. The legs are static and bent.",
    "lying": "lying is static, with the body in place and in a horizontal position. The arms may be in motion or static and may be bent, straight, or bent-straight transform. The legs may be in motion or static and may be bent, straight or bent-straight transform.",
    "cycling sit": "cycling sit involves cyclic and translation motion, with the body in an inclined position and moving forward. The arms are static and may be bent or straight. The hands hold something. The legs are in motion and bent-straight transform. It involves a seat and bike.", 
    "cycling sit inactive": "cycling sit inactive is static, with the body in place and in a vertical or an inclined position. The arms are static and may be bent or straight. The hands may or may not hold something. The legs are static and bent-straight transform. It involves a seat and bike.", 
    "cycling stand inactive": "cycling involves cyclic and translation motion, with the body in an inclined position and moving forward. The arms are static and may be bent or straight. The hands hold something. The legs are in motion and bent-straight transform. It involves a seat and bike."},

"harth1":
    {"walking": "walking involves locomotion towards a destination with one stride or more, (one step with both feet, where one foot is placed at the other side of the other). Walking could occur in all directions. Walking along a curved line is allowed.",
    "running": "running involves locomotion towards a destination, with at least two steps where both feet leave the ground during each stride. Running can be inferred when trunk moves forward is in a constant upward-downward motion with at least two steps. Running along a curved line is allowed.",
    "shuffling": "shuffling involves stepping in place by non-cyclical and non-directional movement of the feet. Includes turning on the spot with feet movement not as part of walking bout. Without being able to see the feet, if movement of the upper body and surroundings indicate non-directional feet movement.",
    "ascending stairs": "ascending stairs involves cyclic motion, with the body in a vertical, inclined position and moving forward and up. The arms are in motion and may be bent, straight or bent-straight transform. The hands hold something. The legs are in motion, bent-straight transform, alternately move forward and up. It involves stairs.",
    "descending stairs": "descending stairs involves cyclic motion, with the body in a vertical, inclined position and moving forward and down. The arms are in motion and may be bent, straight or bent-straight transform. The hands hold something. The legs are in motion, bent-straight transform, alternately move forward and down. It involves stairs.",
    "standing": "standing is upright, feet supporting the person’s body weight, with no feet movement, otherwise this could be shuffling/walking. Movement of upper body and arms is allowed. If feet position is equal before and after upper body movement, standing can be inferred. Without being able to see the feet, if upper body and surroundings indicate no feet movement.",
    "sitting": "sitting is when the person’s buttocks is on the seat of the chair, bed, or floor. Sitting can include some movement in the upper body and legs; this should not be tagged as a separate transition. Adjustment of sitting position is allowed.",
    "lying": "lying involves a person who lies either on the stomach, on the back, or on the right/left shoulder. Movement of arms, feet, and head is allowed.",
    "cycling sit": "cycling sit involves pedaling while the buttocks is placed at the seat. Cycling starts at first pedaling, or when the bike is moving while one/both feet are on the pedal(s). Cycling ends when the first foot is in contact with the ground.",
    "cycling sit inactive": "cycling sit inactive is when one or both feet are placed on the pedal(s), the buttocks is placed at the seat, with no pedaling and the bike is standing still.",
    "cycling stand inactive": "cycling stand inactive is when both feet are on the pedals, with no pedaling and the bike is standing still."},

"uschad": 
    {"walking forward": "walking forward involves cyclic and translation motion, with the body in a vertical postion and moving forward in a straight line. The arms are in motion and bent-straight transform. The legs are in motion, bent-straight transform and alternately move forward.", 
    "walking left": "walking left involes cyclic and translation motion, with the body in a vertical postion and moving counter-clockwise in a full circle. The arms are in motion and bent-straight transform. The legs are in motion, bent-straight transform and alternately move forward.", 
    "walking right": "walking right cyclic and translation motion, with the body in a vertical postion and moving clockwise in a full circle. The arms are in motion and bent-straight transform. The legs are in motion, bent-straight transform and alternately move forward.", 
    "walking upstairs": "walking upstairs involves cyclic motion, with the body in a vertical, inclined position and moving forward and up. The arms are in motion and may be bent, straight or bent-straight transform. The hands hold something. The legs are in motion, bent-straight transform, alternately move forward and up. It involves stairs.", 
    "walking downstairs": "walking downstairs involves cyclic motion, with the body in a vertical, inclined position and moving forward and down. The arms are in motion and may be bent, straight or bent-straight transform. The hands hold something. The legs are in motion, bent-straight transform, alternately move forward and down. It involves stairs.", 
    "running forward": "running forward involves intense cyclic and translation motion, with the body in a vertical position and moving forward. The arms are in motion and bent. The legs are in motion, bent-straight transform and alternately move forward.",
    "jumping": "jumping involves intense cyclic motion, with the body in place and in a vertical position, moving up and down. The arms are in motion and may be bent, straight, or bent-straight transform. The hands hold something. The legs are in motion, and may be bent, straight, or bent-straight transform and moving up and down.", 
    "sitting": "sitting is static, with the body in place and in a vertical position. The arms may be in motion or static and may be bent, straight, or bent-straight transform. The legs are static and bent.", 
    "standing": "standing is static, with the body in place and in a vertical position. The arms may be in motion or static and may be bent, straight, or bent-straight transform. The legs are static and straight.", 
    "sleeping": "lying is static, with the body in place and in a horizontal position. The arms may be in motion or static and may be bent, straight, or bent-straight transform. The legs may be in motion or static and may be bent, straight or bent-straight transform.", 
    "elevator up": "elevator up involves the body in place and in a vertical position in an ascending elevator. The arms may be in motion or static and may be bent, straight, or bent-straight transform. The legs are static and straight.", 
    "elevator down": "elevator down involves the body in place and in a vertical position in a descending elevator. The arms may be in motion or static and may be bent, straight, or bent-straight transform. The legs are static and straight."},

"wisdm": 
    {"walking": "walking involves cyclic and translation motion, with the body in a vertical postion and moving forward. The arms are in motion and bent-straight transform. The legs are in motion, bent-straight transform and alternately move forward.", 
    "jogging": "jogging involves intense cyclic and translation motion, with the body in a vertical position and moving forward. The arms are in motion and bent. The legs are in motion, bent-straight transform and alternately move forward.", 
    "stairs": "stairs involves cyclic motion, with the body in a vertical, inclined position. Body is moving either up or down. The arms are in motion and may be bent, straight or bent-straight transform. The hands hold something. The legs are in motion, bent-straight transform, alternately move up or down.", 
    "sitting": "sitting is static, with the body in place and in a vertical position. The arms may be in motion or static and may be bent, straight, or bent-straight transform. The legs are static and bent.", 
    "standing": "standing is static, with the body in place and in a vertical position. The arms may be in motion or static and may be bent, straight, or bent-straight transform. The legs are static and straight.", 
    "typing": "typing involves using a keyboard to input text or commands. The hand motion includes moving the fingers across the keyboard to press the desired keys. Each finger is assigned specific keys, and the hands may move in a repetitive motion while typing.", 
    "brushing teeth": "brushing teeth involves holding a toothbrush and moving it around the teeth and gums to clean them. The hand motion includes gripping the toothbrush with the fingers and moving it in a back-and-forth or circular motion to brush the teeth effectively.", 
    "eating soup": "eating soup involves using a spoon. The hand motion includes holding the spoon, scooping up the soup, and bringing it to the mouth. The hand grasps the spoon while tilting it to prevent spillage and to consume the liquid and solid components of the soup.",
    "eating chips": "eating chips involves using the fingers to pick up the individual chips and bring them to the mouth. The hand motion includes gripping the chips between the thumb and fingers, adjusting the grip for larger or irregularly shaped chips, and raising the hand to consume the chips.", 
    "eating pasta": "eating pasta involves using a fork and sometimes a spoon. The hand motion includes holding the fork to twirl the pasta strands onto the fork and bringing it to the mouth. The hand grasps the fork while using the other hand to assist in twirling or cutting the pasta.", 
    "drinking from cup": "drinking from a cup involves grasping the cup handle or holding the cup with the hand. The hand motion includes lifting the cup to the mouth, tilting it to drink, and maintaining control to prevent spillage. The hand can adjust the grip as the liquid level decreases.", 
    "eating sandwich": "eating sandwich can involve various hand motions depending on its size and ingredients. The hand typically holds the sandwich with a firm grip, while the fingers may be used to stabilize the filling or compress the sandwich. The hand can alternate between holding and manipulating the sandwich to take bites from different parts.", 
    "kicking soccer ball": "kicking a soccer ball involves striking the ball with the foot to propel it. While the primary motion is performed with the foot, the hand motion includes maintaining balance, positioning the arms for stability, and possibly raising the arms for improved coordination and body control.",
    "playing catch with tennis ball": "playing catch involves tossing and catching a ball between two or more people. The hand motion includes gripping the ball, typically with the fingers spread out, and throwing it with a throwing motion. When catching, the hand extends and closes to secure the ball.", 
    "dribbling basketball": "dribbling basketball is the act of bouncing the ball on the ground while maintaining control. The hand motion involves gripping the ball with one hand or both hands, using the fingers to control the ball's bounce, and moving the hand(s) in a rhythmic motion to keep the ball in play.", 
    "writing": "writing involves using a pen or pencil to create text on paper or another writing surface. The hand motion includes holding the writing instrument between the fingers and moving it to form letters and words. The hand and fingers provide control and precision in shaping the written characters.", 
    "clapping": "clapping is the action of bringing the palms of the hands together repeatedly to produce a clapping sound. The hand motion involves bringing the hands together with a quick, forceful motion and then separating them. The palms make contact, creating the clapping sound.", 
    "folding clothes": "folding clothes requires manipulating fabric to create neat and organized folds. The hand motion includes grasping and holding the clothing item, then using the hands and fingers to fold and crease the fabric in specific ways, such as folding sleeves, collars, and hems."}}